export const lineData = {
  '4': [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    14,
    324,
    0,
    0,
    0,
    0,
    30,
    0,
    0,
    0,
    334,
  ],
  '5': [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    108,
    0,
    0,
    10,
    251,
    104,
    106,
    14,
    0,
    0,
    98,
    71,
    61,
    0,
    132,
    20,
    30,
    61,
    0,
    205,
    193,
    13,
    0,
    44,
  ],
};
export const data1Obj = {
  '4': [
    { x: '面试调研', y: 651, z: '78120s' },
    { x: '面试邀约', y: 0, z: '0s' },
    { x: '面试提醒', y: 0, z: '0s' },
    { x: '背调提醒', y: 0, z: '0s' },
    { x: '入职提醒', y: 51, z: '3060s' },
  ],
  '5': [
    { x: '面试调研', y: 1225, z: '147000s' },
    { x: '面试邀约', y: 44, z: '2640s' },
    { x: '面试提醒', y: 107, z: '6420s' },
    { x: '背调提醒', y: 50, z: '3000s' },
    { x: '入职提醒', y: 95, z: '5700s' },
  ],
};
export const data2Obj = {
  '4': [
    { x: '完成调研', y: 261, z: '57620s' },
    { x: '拒绝调研', y: 200, z: '10000s' },
    { x: '中途挂机', y: 130, z: '9600s' },
    { x: '无人接听', y: 60, z: '900s' },
  ],
  '5': [
    { x: '完成调研', y: 562, z: '127910s' },
    { x: '拒绝调研', y: 323, z: '17650s' },
    { x: '中途挂机', y: 154, z: '980s' },
    { x: '无人接听', y: 156, z: '460s' },
  ],
};
export const data3Obj = {
  '4': [
    { x: '胡沙', y: 702, z: '42120s' },
    { x: '高成月', y: 30, z: '1800s' },
    { x: '崔雯靖', y: 0, z: '0s' },
  ],
  '5': [
    { x: '胡沙', y: 151, z: '9060s' },
    { x: '高成月', y: 1133, z: '135960s' },
    { x: '崔雯靖', y: 99, z: '5940s' },
  ],
};
export const data4Obj = {
  '4': {
    胡沙: [
      { x: '面试调研', y: 651, z: '18120s' },
      { x: '面试邀约', y: 0, z: '0s' },
      { x: '面试提醒', y: 0, z: '0s' },
      { x: '背调提醒', y: 0, z: '0s' },
      { x: '入职提醒', y: 51, z: '3060s' },
    ],
    高成月: [
      { x: '面试调研', y: 0, z: '0s' },
      { x: '面试邀约', y: 0, z: '0s' },
      { x: '面试提醒', y: 30, z: '1800s' },
      { x: '背调提醒', y: 0, z: '0s' },
      { x: '入职提醒', y: 0, z: '0s' },
    ],
    崔雯靖: [
      { x: '面试调研', y: 0, z: '0s' },
      { x: '面试邀约', y: 0, z: '0s' },
      { x: '面试提醒', y: 0, z: '0s' },
      { x: '背调提醒', y: 0, z: '0s' },
      { x: '入职提醒', y: 0, z: '0s' },
    ],
  },
  '5': {
    胡沙: [
      { x: '面试调研', y: 0, z: '0s' },
      { x: '面试邀约', y: 44, z: '2640s' },
      { x: '面试提醒', y: 107, z: '6420s' },
      { x: '背调提醒', y: 0, z: '0s' },
      { x: '入职提醒', y: 0, z: '0s' },
    ],
    高成月: [
      { x: '面试调研', y: 1133, z: '135960s' },
      { x: '面试邀约', y: 0, z: '0s' },
      { x: '面试提醒', y: 0, z: '0s' },
      { x: '背调提醒', y: 0, z: '0s' },
      { x: '入职提醒', y: 0, z: '0s' },
    ],
    崔雯靖: [
      { x: '面试调研', y: 0, z: '0s' },
      { x: '面试邀约', y: 0, z: '0s' },
      { x: '面试提醒', y: 0, z: '0s' },
      { x: '背调提醒', y: 20, z: '1200s' },
      { x: '入职提醒', y: 79, z: '47400s' },
    ],
  },
};
export const mock = [
  {
    count: 29,
    total_time_elapsed_sec: 262498,
    time: '2019-07-28',
    tenantId: 'd9af2ad1-823f-4b07-b65a-28d5605cfb6e', // 京东数科
  },
  {
    count: 31,
    total_time_elapsed_sec: 262498,
    time: '2019-07-28',
    tenantId: 'b58f5fae-6b01-4185-937d-c83582b323ad', // 京东商城
  },
  {
    count: 2,
    total_time_elapsed_sec: 345634,
    time: '2019-07-30',
    tenantId: '42777d15-ffb5-4bf0-8351-41fcf30020b8', // 京东物流
  },
  {
    count: 3,
    total_time_elapsed_sec: 0,
    time: '2020-07-14',
    tenantId: '75965b66-30a8-4565-ac56-4c8418ee397d', // 京东物流-物流一部
  },
  {
    count: 1,
    total_time_elapsed_sec: 0,
    time: '2020-07-15',
    tenantId: '4d13d407-a955-4234-8287-f83aa627d4ae',// 京东物流-物流一部-一部张三
  },
  {
    count: 1,
    total_time_elapsed_sec: 0,
    time: '2020-07-17',
    tenantId: 'e2a12c4b-8f01-4d5c-99aa-f9c2cae758f1',// 升降桌
  },
  {
    count: 20,
    total_time_elapsed_sec: 0,
    time: '2020-07-18',
    tenantId: 'ee3dc52d-c9d5-45e7-8923-24f94495aa89', // 升降桌 - 升降桌一
  },
  {
    count: 0,
    total_time_elapsed_sec: 0,
    time: '2020-07-18',
    tenantId: 'e31b258d-c240-48a9-a6b2-fe17053472e7', // 老大
  },
];
